tests/validation/galinat_axi/runs/m2/0/k.oil
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k.oil;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.34e-04; 

boundaryField
{
    outlet
    {
        type            inletOutlet;
        phi             phi.oil;
        inletValue      uniform 1.34e-04;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1.34e-04;
    }
    walls
    {
        type            kqRWallFunction;
	value		uniform 1e-10;
    }
    front
    {
        type wedge;
    }
    back
    {
        type wedge;
    }
    axis
    {
       type      symmetryPlane;
    }
}


// ************************************************************************* //
